КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_НастройкиКонвертацииСправочников/КонтурЛогистика_НастройкиКонвертацииСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_НастройкиКонвертацииСправочников</name>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыНастроекКонвертаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСправочникаИлиДокументаУС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСправочникаЛогистика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитТитула</name>
    <comment>если не указан - для всех прикладных сущностей соответствующих указанному ТипСправочникаЛогистика</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_РеквизитыТитуловДляНастроекКонвертацииСправочников</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьРеквизитыИзУчетнойСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеКонвертации</name>
    <type>
      <types>EnumRef.КонтурЛогистика_НаправлениеКонвертации</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьЭлементСправочникаУчетнойСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПравилаКонвертации</name>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаТипЗначения</name>
      <comment>какого типа этот заполняемый реквизит</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
        <types>EnumRef.КонтурЛогистика_ВидыКонтактнойИнформации</types>
        <types>Boolean</types>
        <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
        <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
        <types>String</types>
        <types>CatalogRef.КонтурЛогистика_Договоры</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
        <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаКомментарий</name>
      <comment>для того чтобы разъяснить пользователю особенности этого реквизита</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособМаппинга</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыМаппингаПоля</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления</name>
      <comment>как вычислять. Для маппинга доп свойств - указывается как получить реквизит, чье доп свойство требуется вычислить</comment>
      <type>
        <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючДопСвойстваРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления2</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособКонвертацииЗначения</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыКонвертации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбновитьИзУчетнойСистемы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисленияСтрокаНеогр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КонвертироватьПоНастройке</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииСправочников</types>
      </type>
    </attributes>
    <attributes>
      <name>СвойствоОбъекта</name>
      <comment>Код свойства объекта</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаСоответствий</name>
    <attributes>
      <name>РеквизитСправочникаЛогистика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзвлеченноеЗначение</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ВсеСправочникиУчетнойСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособМаппинга</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыМаппингаПоля</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления</name>
      <comment>как вычислять. Для маппинга доп свойств - указывается как получить реквизит, чье доп свойство требуется вычислить</comment>
      <type>
        <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаОбратнойКонвертации</name>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаТипЗначения</name>
      <comment>какого типа этот заполняемый реквизит</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
        <types>EnumRef.КонтурЛогистика_ВидыКонтактнойИнформации</types>
        <types>Boolean</types>
        <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
        <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
        <types>String</types>
        <types>CatalogRef.КонтурЛогистика_Договоры</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
        <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаКомментарий</name>
      <comment>для того чтобы разъяснить пользователю особенности этого реквизита</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособМаппинга</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыМаппингаПоля</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления</name>
      <comment>как вычислять. Для маппинга доп свойств - указывается как получить реквизит, чье доп свойство требуется вычислить</comment>
      <type>
        <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючДопСвойстваРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления2</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособКонвертацииЗначения</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыКонвертации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбновитьИзУчетнойСистемы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисленияСтрокаНеогр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КонвертироватьПоНастройке</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииСправочников</types>
      </type>
    </attributes>
    <attributes>
      <name>СвойствоОбъекта</name>
      <comment>Код свойства объекта</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаполнениеСпрУчСист</name>
    <attributes>
      <name>ТипАлгоритма</name>
      <type>
        <types>EnumRef.КонтурЛогистика_АлгоритмыЗаполнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчета</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыРасчетаЗначениейДокУчСист</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления</name>
      <comment>как вычислять. Для маппинга доп свойств - указывается как получить реквизит, чье доп свойство требуется вычислить</comment>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисленияТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисленияСтрокаНеогр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КонвертироватьПоНастройке</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииСправочников</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисленияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбновитьИзДокУчСист</name>
      <comment>Обновлять значение реквизита, даже если оно уже заполнено</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючевоеПоле</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Скрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/CommonForms/КонтурЛогистика_ЗаполнениеСправочниковЛогистикиИзУчетных/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ТипСправочникаЛогистика") Тогда
		Возврат;
	КонецЕсли;
	
	ТипСправочникаЛогистика = Параметры.ТипСправочникаЛогистика;
	
	ЗаполнитьСписокВыбораТипаУчетныхОбъектов();
	
	ОбновитьДанныеПоНастройкеКонвертации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьДоступность();
	
	Если ТипСправочникаЛогистика = "КонтурЛогистика_ОрганизацииДиадок" Тогда
		Элементы.ОбъектыУчетнойСистемыОбъектУчетнойСистемы.Заголовок = "Наименование";
		Элементы.ОбъектыУчетнойСистемыОсновнойРеквизитУчетнойСистемы.Видимость = Истина;
		Элементы.ОбъектыУчетнойСистемыОсновнойРеквизитУчетнойСистемы.Заголовок = "ИНН";
	Иначе
		Элементы.ОбъектыУчетнойСистемыГруппа.ОтображатьВШапке = Ложь;
		Элементы.ОбъектыУчетнойСистемыОсновнойРеквизитУчетнойСистемы.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаКонвертацииПриИзменении(Элемент)
	
	ОбновитьДанныеПоНастройкеКонвертации();
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСправочникаИлиДокументаУСПриИзменении(Элемент)
	
	ОбновитьДанныеПоНастройкеКонвертации();
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыУчетнойСистемы

&НаКлиенте
Процедура ОбъектыУчетнойСистемыПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОбъектыУчетнойСистемы.ТекущиеДанные;
	Если Не ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ПомеченнаяГруппа = ОбъектыУчетнойСистемы.НайтиПоИдентификатору(Элементы.ОбъектыУчетнойСистемы.ТекущаяСтрока);
	ПометитьЭлементыГруппы(ПомеченнаяГруппа.ПолучитьЭлементы(), ТекущиеДанные.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьЭлементыГруппы(ЭлементыГруппы, ЗначениеПометки, Отбор = Неопределено)
	
	Для Каждого ТекущийЭлементГруппы Из ЭлементыГруппы Цикл
		
		Если ТекущийЭлементГруппы.ЭтоГруппа Тогда
			ПометитьЭлементыГруппы(ТекущийЭлементГруппы.ПолучитьЭлементы(), ЗначениеПометки, Отбор);
		КонецЕсли;
		
		Если Отбор = Неопределено Тогда
			ТекущийЭлементГруппы.Пометка = ЗначениеПометки;
		Иначе
			Если ТекущийЭлементГруппы[Отбор.ИмяРеквизита] = Отбор.Значение Тогда
				ТекущийЭлементГруппы.Пометка = ЗначениеПометки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыУчетнойСистемыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОбъектыУчетнойСистемы.ТекущиеДанные;
	
	Если Поле = Элементы.ОбъектыУчетнойСистемыОбъектУчетнойСистемы
		И ЗначениеЗаполнено(ТекущиеДанные.ОбъектУчетнойСистемы) Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ТекущиеДанные.ОбъектУчетнойСистемы);
		
	ИначеЕсли Поле = Элементы.ОбъектыУчетнойСистемыОбъектЛогистики
		И ЗначениеЗаполнено(ТекущиеДанные.ОбъектЛогистики) Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ТекущиеДанные.ОбъектЛогистики);
		
	ИначеЕсли Поле = Элементы.ОбъектыУчетнойСистемыДействие
		И ЗначениеЗаполнено(ТекущиеДанные.Действие) Тогда
		
		ОбработатьСтрокуОбъектаУчетнойСистемы(Элементы.ОбъектыУчетнойСистемы.ТекущаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПротоколНажатие(Элемент)
	
	Элементы.Протокол.Видимость = Не Элементы.Протокол.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обработать(Команда)
	
	ОбработатьОбъектыУчетнойСистемыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ПометитьЭлементыГруппы(ОбъектыУчетнойСистемы.ПолучитьЭлементы(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ПометитьЭлементыГруппы(ОбъектыУчетнойСистемы.ПолучитьЭлементы(), Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьДействиеСоздать(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяРеквизита", "Действие");
	Отбор.Вставить("Значение", "создать");
	
	ПометитьЭлементыГруппы(ОбъектыУчетнойСистемы.ПолучитьЭлементы(), Истина, Отбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьДействиеПерезаполнить(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяРеквизита", "Действие");
	Отбор.Вставить("Значение", "перезаполнить");
	
	ПометитьЭлементыГруппы(ОбъектыУчетнойСистемы.ПолучитьЭлементы(), Истина, Отбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПротокол(Команда)
	
	Протокол = "";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьДоступность()
	
	Если ЗначениеЗаполнено(НастройкаКонвертации) Или ЗначениеЗаполнено(ТипСправочникаИлиДокументаУС) Тогда
		Элементы.ОбъектыУчетнойСистемы.Видимость = Истина;
	Иначе
		Элементы.ОбъектыУчетнойСистемы.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТипаУчетныхОбъектов()
	
	ТипыСправочниковКонфигурации1С = КонтурЛогистика_КонвертацияТиповые.ПоддерживаемыеТипыСправочниковКонфигурации1С(
		ТипСправочникаЛогистика);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипСправочникаЛогистика", ТипСправочникаЛогистика);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаИлиДокументаУС КАК ТипСправочникаИлиДокументаУС
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников КАК КонтурЛогистика_НастройкиКонвертацииСправочников
	|ГДЕ
	|	НЕ КонтурЛогистика_НастройкиКонвертацииСправочников.ПометкаУдаления
	|	И КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаЛогистика = &ТипСправочникаЛогистика";
	
	ТипыИзНКД = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТипСправочникаИлиДокументаУС");
	КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.ДополнитьМассивЛок(ТипыСправочниковКонфигурации1С, ТипыИзНКД, Истина);
	
	Элементы.ТипСправочникаИлиДокументаУС.СписокВыбора.ЗагрузитьЗначения(ТипыСправочниковКонфигурации1С);
	
	Если ТипыСправочниковКонфигурации1С.Количество() = 1 Тогда
		ТипСправочникаИлиДокументаУС = ТипыСправочниковКонфигурации1С[0];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоНастройкеКонвертации()
	
	Если Не ЗначениеЗаполнено(ТипСправочникаИлиДокументаУС) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда
		ТипСправочникаЛогистика = НастройкаКонвертации.ТипСправочникаЛогистика;
		ТипСправочникаИлиДокументаУС = НастройкаКонвертации.ТипСправочникаИлиДокументаУС;
	Иначе
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииСправочника(
			ТипСправочникаЛогистика, ТипСправочникаИлиДокументаУС);
		ЕстьТиповаяКонвертация = КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация;
	КонецЕсли;
	
	ЭтоДокумент = (Метаданные.Справочники.Найти(ТипСправочникаИлиДокументаУС) = Неопределено);
	
	Если ЭтоДокумент Тогда
		Иерархический = Ложь;
	Иначе
		Иерархический = Метаданные.Справочники.Найти(ТипСправочникаИлиДокументаУС).Иерархический;
		Если Иерархический
			И Строка(Метаданные.Справочники.Найти(ТипСправочникаИлиДокументаУС).ВидИерархии) = "ИерархияЭлементов" Тогда
			
			Иерархический = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	<ТипСправочникаИлиДокументаУС>.Ссылка КАК ОбъектУчетнойСистемы,
	|	<ТипСправочникаИлиДокументаУС>.ЭтоГруппа КАК ЭтоГруппа,
	|	МАКСИМУМ(<ТипСправочникаЛогистика>.Ссылка) КАК ОбъектЛогистики,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ <ТипСправочникаЛогистика>.Ссылка) КАК КоличествоОбъектовЛогистики,
	|	ВЫБОР
	|		КОГДА <ТипСправочникаИлиДокументаУС>.ЭтоГруппа
	|			ТОГДА """"
	|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ <ТипСправочникаЛогистика>.Ссылка) = 0
	|			ТОГДА ""создать""
	|		ИНАЧЕ ""перезаполнить""
	|	КОНЕЦ КАК Действие
	|ИЗ
	|	<ТипГлавногоОбъекта>.<ТипСправочникаИлиДокументаУС> КАК <ТипСправочникаИлиДокументаУС>
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.<ТипСправочникаЛогистика>.СвязанныеОбъекты КАК <ТипСправочникаЛогистика>
	|		ПО (<ТипСправочникаЛогистика>.СвязанныйОбъект = <ТипСправочникаИлиДокументаУС>.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	<ТипСправочникаИлиДокументаУС>.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектУчетнойСистемы ИЕРАРХИЯ";
	
	// Подставим в запросе значения переменных
	Если Не Иерархический Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ТипСправочникаИлиДокументаУС>.ЭтоГруппа", "ЛОЖЬ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИЕРАРХИЯ", "");
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ТипСправочникаЛогистика>", ТипСправочникаЛогистика);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ТипСправочникаИлиДокументаУС>", ТипСправочникаИлиДокументаУС);
	Если ЭтоДокумент Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ТипГлавногоОбъекта>", "Документ");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ТипГлавногоОбъекта>", "Справочник");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Иерархический Тогда
		ИерархическаяВыборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Иначе
		ИерархическаяВыборка = РезультатЗапроса.Выбрать();
	КонецЕсли;
	
	ДеревоОбъектыУчетнойСистемы = РеквизитФормыВЗначение("ОбъектыУчетнойСистемы");
	
	// Заполним дерево
	ДеревоОбъектыУчетнойСистемы.Строки.Очистить();
	ЗаполнитьДеревоОбъектыУчетнойСистемы(ДеревоОбъектыУчетнойСистемы.Строки, ИерархическаяВыборка);
	
	ЗначениеВРеквизитФормы(ДеревоОбъектыУчетнойСистемы, "ОбъектыУчетнойСистемы");
	
	СоответствиеТиповЗначениям = Перечисления.КонтурЛогистика_СпособыКонвертации.СоответствиеТиповЗначениям();
	СпособыКонвертации = СоответствиеТиповЗначениям.Получить(Тип("СправочникСсылка." + ТипСправочникаЛогистика));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОбъектыУчетнойСистемы(СтрокиДерева, Выборка)
	
	Пока Выборка.Следующий() Цикл 
		
		НовСтрока = СтрокиДерева.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		
		// Заполним основные реквизиты объектов учетной системы
		Если ТипСправочникаЛогистика = "КонтурЛогистика_ОрганизацииДиадок" Тогда
			Если Выборка.ОбъектУчетнойСистемы.Метаданные().Реквизиты.Найти("ИНН") <> Неопределено Тогда
				НовСтрока.ОсновнойРеквизитУчетнойСистемы = Выборка.ОбъектУчетнойСистемы.ИНН;
			КонецЕсли;
		КонецЕсли;
		
		ВыборкаПодчиненная = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Если ВыборкаПодчиненная.Количество() <> 0 Тогда 
			
			ЗаполнитьДеревоОбъектыУчетнойСистемы(НовСтрока.Строки, ВыборкаПодчиненная);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокуОбъектаУчетнойСистемы(ТекущаяСтрока)
	
	ТекущиеДанные = ОбъектыУчетнойСистемы.НайтиПоИдентификатору(ТекущаяСтрока);
	
	ОбработатьЭлемент(ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОбъектыУчетнойСистемыНаСервере()
	
	ДобавитьВПротокол("=== Начало обработки ===");
	
	ОбработатьЭлементыУчетнойСистемыНаСервере(ОбъектыУчетнойСистемы.ПолучитьЭлементы());
	
	ДобавитьВПротокол("=== Окончание обработки ===");
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЭлементыУчетнойСистемыНаСервере(ЭлементыОбработки)
	
	Для Каждого ТекущиеДанные Из ЭлементыОбработки Цикл
		
		Если ТекущиеДанные.ЭтоГруппа Тогда
			
			ОбработатьЭлементыУчетнойСистемыНаСервере(ТекущиеДанные.ПолучитьЭлементы());
			
		Иначе
			
			Если Не ТекущиеДанные.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			ОбработатьЭлемент(ТекущиеДанные);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЭлемент(ЭлементУчетнойСистемы)
	
	ЭтоКонвертация = Ложь;
	
	Результат = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_КонвертироватьЗначениеВОбъектЛогистики(
		ЭлементУчетнойСистемы.ОбъектУчетнойСистемы, СпособыКонвертации, РеквизитТитула);
	
	Если Результат.Успешно Тогда
		
		Если Результат.Свойство("Значение") Тогда
			ЭлементУчетнойСистемы.ОбъектЛогистики = Результат.Значение;
			Если ЭлементУчетнойСистемы.КоличествоОбъектовЛогистики = 0 Тогда
				ЭлементУчетнойСистемы.КоличествоОбъектовЛогистики = 1;
				ЭлементУчетнойСистемы.Действие = "перезаполнить";
			КонецЕсли;
		КонецЕсли;
		
		ТекстСообщения = Строка(ЭлементУчетнойСистемы.ОбъектУчетнойСистемы) + " >> " + Строка(ЭлементУчетнойСистемы.ОбъектЛогистики);
		ДобавитьВПротокол(ТекстСообщения);
		
	Иначе
		
		ТекстСообщения = "Ошибка при конвертации объекта: " + Строка(ЭлементУчетнойСистемы.ОбъектУчетнойСистемы) + "
			|Текст ошибки: " + Результат.ОписаниеОшибки;
		ДобавитьВПротокол(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВПротокол(ТекстСообщения)
	
	Протокол = Строка(ТекущаяДатаСеанса()) + " " + ТекстСообщения
		+ ?(Протокол = "", "", Символы.ПС) + Протокол;
	
КонецПроцедуры

#КонецОбласти
